<?php defined('SYSPATH') or die('No direct access allowed.');

$lang = array
(
	'no_connection'       => 'Не е пронајден валиден ID за конекција.  Проверете дали сте конектирани пред да изведете било какви рутини со датотеките.',
	'unable_to_connect'   => 'Не е можно конектирање со FTP серверот користејќи го овој hostname.',
	'unable_to_login'     => 'Не е можно логирање на FTP серверот.  Проверете ги username и password-от.',
	'unable_to_makdir'    => 'Не е можно креирање на директориумот кој го специфициравте.',
	'unable_to_changedir' => 'Не е можно промена на директориуми.',
	'unable_to_chmod'     => 'Не е можно сетирање на дозволите (file permissions).  Проверете ја патеката. Забелешка: Ова својство е достапно само во PHP 5 или поголема верзија.',
	'unable_to_upload'    => 'Не е можно качување на избраната датотека. Проверете ја патеката.',
	'no_source_file'      => 'Не е пронајдена изворната датотека.  Проверете ја патеката.',
	'unable_to_remame'    => 'Не е можно преименување на датотеката.',
	'unable_to_delete'    => 'Не е можно бришење на датотеката.',
	'unable_to_move'      => 'Не е можно преместување на датотеката.  Проверете дали постои директориумот во кој треба да биде преместена.'	
);
