<?php defined('SYSPATH') or die('No direct access allowed.');

$lang = array
(
	'driver_not_supported' => 'Запрошенный драйвер архиватора, %s, не найден.',
	'driver_implements'    => 'Запрошенный драйвер архиватора, %s, не реализует класс Archive_Driver.',
	'directory_unwritable' => 'Директория "%s", в которую вы сохраняете файл, не доступна для записи. Пожалуйста, исправьте права доступа и повторите попытку.',
	'filename_conflict'    => 'Архив "%s" уже существует и недоступен для записи. Пожалуйста, удалите конфликтующий файл и повторите попытку.'
);
