<?php defined('SYSPATH') or die('No direct access allowed.');

$lang = array
(
	'undefined_group'       => 'Группа %s не определена в Вашей конфигурации.',
	'error'                 => 'Ошибка SQL: %s',
	'connection'            => 'Ошибка при подключении к базе: %s',
	'driver_not_supported'  => 'Запрошенный драйвер базы данных, %s, ненайден.',
	'invalid_dsn'           => 'Предложенный DSN некорректен: %s',
	'must_use_set'          => 'Необходимо использовать оператор SET в этом запросе.',
	'must_use_where'        => 'Необходимо использовать оператор WHERE в этом запросе.',
	'must_use_table'        => 'Необходимо указать таблицу базы данных в этом запросе.',
	'table_not_found'       => 'Таблица %s не существует в Вашей базе данных.',
	'not_implemented'       => 'Запрошенный метод, %s, не поддерживается этим драйвером.',
);