<?php defined('SYSPATH') or die('No direct access allowed.');

$lang = array
(
	'no_connection'       => 'Невозможно найти идентификатор подключения. Удостоверьтесь, что вы подключены, перед выполнением операций с файлами.',
	'unable_to_connect'   => 'Невозможно подключиться к FTP-серверу на указанном узле.',
	'unable_to_login'     => 'Невозможно авторизоваться на FTP-сервере. Пожалуйста, проверьте имя пользователя и пароль.',
	'unable_to_makdir'    => 'Невозможно создать запрошенную директорию.',
	'unable_to_changedir' => 'Невозможно сменить директорию.',
	'unable_to_chmod'     => 'Невозможно установить права доступа к файлам. Проверьте путь к файлу. Примечание: Этот функционал доступен только в PHP5.',
	'unable_to_upload'    => 'Невозможно закачать указанный файл. Проверьте путь к файлу.',
	'no_source_file'      => 'Невозможно найти файл-источник. Проверьте путь к файлу.',
	'unable_to_remame'    => 'Невозможно переименовать файл.',
	'unable_to_delete'    => 'Невозможно удалить файл.',
	'unable_to_move'      => 'Невозможно переместить файл. Удостоверьтесь в наличии целевой директории.'
);
