<?php defined('SYSPATH') or die('No direct script access.');

$lang = array
(
	'title'				=> 'Помощь проекту',
	'subtitle'			=> 'Дотации',
	'help'				=> 'Чтобы помочь проекту Kohana, введите сумму и нажмите кнопку "Submit". Вы перейдете на сайт PayPal, затем вы вернетесь на наш сайт, чтобы заверщить дотацию.',
	'list'				=> 'Кто нам помог',
	'list_help'			=> 'Ниже приведены имена тех, кто уже помог проекту Kohana.',
	'name'				=> 'Имя',
	'email'				=> 'Email',
	'amount'			=> 'Сумма',
	'error'				=> 'Произошла ошибка при обработке вашей дотации. Пожалуйста, попробуйте еще раз.',
	'paypal'			=> 'Дотировать с помощью PayPal',
	'paypal_help'		=> 'Нажмите на кнопку, чтобы завершить процесс дотации.',
	'total_amount'			=> 'Вы дотируете <strong>$%s</strong>',
	'thanks'			=> 'Спасибо за вашу дотацию!',
	'confirm_payment'	=> 'Подтвердить Вашу дотацию',
);