<p class="intro">Последние <strong>новости</strong> и <strong>объявления</strong> от команды разработчиков Kohana.</p>
<h2>Kohana присоединяется к GoPHP5!</h2>
<p>Команда разработчиков Kohana рада сообщить о присоединении к <?php echo html::anchor('http://gophp5.org', 'GoPHP5 initiative') ?>.</p>
<p>Переход на PHP 5 не был простым для многих людей, поскольку ранние версии PHP 5 были медленными, имели много ошибок, и впринципе не были завершенными. С выходом PHP 5.2 эти проблемы практически решены. PHP 5.2 обладает высокой производительностью, полным набором функций и является стабильной платформой для создания web-приложений.</p>
<p>Переход Kohana на PHP 5.2 обеспечит высокий уровень стабильности и понимаемости как для пользователей, так и для разработчиков, и мы надеемся в полной мере воспользоваться новыми возможностями в следующем официальном релизе Kohana.</p>
